{
  "generatedAt": "2025-10-10T09:47:02.237Z",
  "items": [
    {
      "id": "3c0aae00edb0f423b4fd9025d4cf0204fda98830",
      "domain": "POWER",
      "tier": "MEDIA",
      "source": "Vanguard",
      "title": "Russia hits Ukraine with ‘massive’ strikes, power cuts in Kyiv",
      "summary": "Ukraine said on Friday that Russia had launched a \"massive attack\" on the capital Kyiv, triggering power cuts as a minister warned that Moscow was also striking hard at the national energy grid. The post Russia hits Ukraine with ‘massive’ strikes, power cuts in Kyiv appeared first on Vanguard News.",
      "publishedAt": "2025-10-10T09:16:34+01:00",
      "officialUrl": "https://www.vanguardngr.com/2025/10/russia-hits-ukraine-with-massive-strikes-power-cuts-in-kyiv/"
    },
    {
      "id": "660ce0cd432ad88155850d6c1d2d9a2ac49c57fc",
      "domain": "POWER",
      "tier": "MEDIA",
      "source": "Daily Trust",
      "title": "APC disqualifies 2 Ekiti gov’ship aspirants, dissolves Enugu exco",
      "summary": "The ruling All Progressives Congress (APC) has disqualified two contenders from its governorship primaries in Ekiti State slated for next year. APC Deputy National Publicity Secretary Duro Meseko disclosed this to newsmen after the National Working Committee (NWC) meeting held yesterday at the party’s national secretariat in Abuja. He said the incumbent governor, Abiodun Oyebanji, […]",
      "publishedAt": "2025-10-10T08:55:16+01:00",
      "officialUrl": "https://dailytrust.com/apc-disqualifies-2-ekiti-govship-aspirants-dissolves-enugu-exco/"
    },
    {
      "id": "3f794ce4de72d9186abbac134a122e252e211674",
      "domain": "POWER",
      "tier": "MEDIA",
      "source": "Daily Trust",
      "title": "Ex-deputy govs push for good governance",
      "summary": "Former deputy governors across Nigeria yesterday converged in Abuja to launch their new secretariat and pledged to promote patriotism, good governance, and national unity. Among those present were Senator Aliyu Wamakko (Sokoto), Dr Chris Akomas (Abia), Pauline Tallen (Plateau), Alhaji Abdulmalik Mahmood (Bauchi), Prince Ezeakonobi Madumere (Imo), Tele Ikuru (Rivers), and James Magaji (Kaduna). The […]",
      "publishedAt": "2025-10-10T08:46:26+01:00",
      "officialUrl": "https://dailytrust.com/ex-deputy-govs-push-for-good-governance/"
    },
    {
      "id": "f16518f1ca9703a075d0a549339d98f78e38798f",
      "domain": "EXAMS",
      "tier": "MEDIA",
      "source": "Vanguard",
      "title": "Accommodation crisis hits varsities, students, parents wail",
      "summary": "HOMELESSNESS is gradually creeping into university campuses in the country as a result of inadequate accommodation for students, with some having to roam about looking for where to lay their heads after the day’s academic work. The post Accommodation crisis hits varsities, students, parents wail appeared first on Vanguard News.",
      "publishedAt": "2025-10-10T07:24:00+01:00",
      "officialUrl": "https://www.vanguardngr.com/2025/10/accommodation-crisis-hits-varsities-students-parents-wail/"
    },
    {
      "id": "433ceafd471ac30e31d66718779bf5112284fca4",
      "domain": "POWER",
      "tier": "MEDIA",
      "source": "Vanguard",
      "title": "POWER: Bilateral companies owe Nigeria $8.5m — NERC",
      "summary": "By Yinka Kolawole, with agency report The Nigerian Electricity Regulatory Commission (NERC) has reported that some international bilateral companies owe Nigeria’s electricity generation companies (GenCos) about $8.5 million in unpaid power supply. In its latest quarterly report, the Commission said the companies made a payment of $9.015 million from an invoice of $17.54 million issued to them […] The post POWER: Bilateral companies owe Nigeria $8.5m — NERC appeared first on Vanguard News.",
      "publishedAt": "2025-10-10T05:57:39+01:00",
      "officialUrl": "https://www.vanguardngr.com/2025/10/power-bilateral-companies-owe-nigeria-8-5m-nerc/"
    },
    {
      "id": "1ced39a52560d3c16cb0f04cf11e5a45bcd5a055",
      "domain": "POWER",
      "tier": "MEDIA",
      "source": "Vanguard",
      "title": "Odinkalu tasks Nigerians to abandon colonial legacies",
      "summary": "By Demola Akinyemi, Ilorin Former Chairman, National Human Rights Commission of Nigeria (NHRCN) Professor Chidi Anselm Odinkalu has bemoaned the colonial legacies in Nigeria, describing it as deeply shameful, urging the people to disconnect from it and take a fresh path to regenerate a genuine leadership system for the country. Odinkalu said this at the […] The post Odinkalu tasks Nigerians to abandon colonial legacies appeared first on Vanguard News.",
      "publishedAt": "2025-10-10T05:37:24+01:00",
      "officialUrl": "https://www.vanguardngr.com/2025/10/odinkalu-tasks-nigerians-to-abandon-colonial-legacies/"
    },
    {
      "id": "7e2fe6e9fa9f1131740a8ea59d0ec71bb5376d08",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "Eko DisCo registers electricity company as Lagos subsidiary",
      "summary": "Eko Electricity Distribution Company Plc (EKEDC) has formally registered Excel Electricity Distribution Company Limited as a wholly owned subsidiary to oversee its electricity distribution operations within Lagos State. Read More",
      "publishedAt": "2025-10-09T13:39:14+01:00",
      "officialUrl": "https://kadunaelectric.com/eko-disco-registers-electricity-company-as-lagos-subsidiary/"
    },
    {
      "id": "372b7ecd0c531bd2c0d33b9c0808e7ec268452e4",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "NSE: With 55% Grid Access, Nigeria Faces Persistent Energy Challenges",
      "summary": "Despite Nigeria’s installed capacity of 13,014 MW serving over 220 million people, only 55 per cent of Nigerians has grid access, highlighting persistent energy challenges in the country, the Nigerian Society of Engineers (NSE) has said. Read More",
      "publishedAt": "2025-10-09T13:28:26+01:00",
      "officialUrl": "https://kadunaelectric.com/nse-with-55-grid-access-nigeria-faces-persistent-energy-challenges/"
    },
    {
      "id": "342c97a45a7ddb73fb98026d099f2390a55dda25",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "BREAKING: Nigerian Authorities Delist 1.9 Million Electricity Customers For Inactivity In One Year",
      "summary": "A Sahara Reporters review of data from the Nigerian Electricity Regulatory Commission (NERC) has revealed that 1.9 million customers were delisted from the Commission’s database between March and June 2025. Read More",
      "publishedAt": "2025-10-09T13:24:53+01:00",
      "officialUrl": "https://kadunaelectric.com/breaking-nigerian-authorities-delist-1-9-million-electricity-customers-for-inactivity-in-one-year/"
    },
    {
      "id": "f11ea0822781d25ccedda066d2a6938ab3ba9959",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "Spike in electricity demand pushes subsidy to N514b in three months",
      "summary": "Nigeria’s electricity market continues to be weighed down by subsidy payments and inefficiencies as taxpayers incurred N514.35 billion to subsidise electricity consumption in just three months, largely driven by high demand from residents of Lagos and Abuja. Read More",
      "publishedAt": "2025-10-08T10:09:15+01:00",
      "officialUrl": "https://kadunaelectric.com/spike-in-electricity-demand-pushes-subsidy-to-n514b-in-three-months/"
    },
    {
      "id": "0ac14bf6abab4a2362158ca233617189fa355ceb",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "FG to add 7,000MW to national grid –Power minister",
      "summary": "The Minister of Power, Chief Adebayo Adelabu, has announced that the Federal Government is moving into the first phase of the Siemens power project, which will add an additional 7,000 megawatts to the national grid and help stabilise electricity supply across the country. Read More",
      "publishedAt": "2025-10-08T10:06:08+01:00",
      "officialUrl": "https://kadunaelectric.com/fg-to-add-7000mw-to-national-grid-power-minister/"
    },
    {
      "id": "aaf7ab81f8ebe72d7eb85471aab37d98866e9ad1",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "FG Targets Market Stability, Infrastructure Upgrade In Power Reforms",
      "summary": "The Federal Government says ongoing reforms in Nigeria’s electricity market are focused on stabilising revenue, improving supply reliability, and upgrading key infrastructure to support industrial growth…. Read More",
      "publishedAt": "2025-10-07T12:27:09+01:00",
      "officialUrl": "https://kadunaelectric.com/fg-targets-market-stability-infrastructure-upgrade-in-power-reforms/"
    },
    {
      "id": "4752f7f3b0bd9c9b2a880af290a778fa2e26e7c2",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "Lagos licenses new electricity distribution firms to replace Eko, Ikeja DisCos",
      "summary": "The Lagos State Electricity Regulatory Commission (LASERC) has officially granted power distribution licences to Excel Distribution Company Limited and IE Energy Lagos Limited, marking a major milestone in the state’s journey toward an independent and competitive electricity market. Read More",
      "publishedAt": "2025-10-07T12:22:43+01:00",
      "officialUrl": "https://kadunaelectric.com/lagos-licenses-new-electricity-distribution-firms-to-replace-eko-ikeja-discos/"
    },
    {
      "id": "81542543f0b7619703ce8597eeed25a76110d737",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "Power sector revenue to exceed N2trn by 2025 – Adelabu",
      "summary": "Adebayo Adelabu, minister of power has said that power sector revenue is expected to exceed N2 trillion, up from N1.7 trillion recorded in 2024. This increase in revenue according to the Minister is driven by the tariff policy reform being implemented by the government. Read More",
      "publishedAt": "2025-10-07T12:15:26+01:00",
      "officialUrl": "https://kadunaelectric.com/power-sector-revenue-to-exceed-n2trn-by-2025-adelabu/"
    },
    {
      "id": "e2c330627b7e43d0bbd28e2f42e951f408bea265",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "House Committee Tasks NDPHC on Improvement of Safety Standards, Workers’ Welfare at Calabar Power Plant",
      "summary": "The House of Representatives Committee on Safety Standards and Regulations has urged Niger Delta Power Holding Company (NDPHC) to improve further on safety standards at the 565 megawatts (MW) Calabar Power Plant in Odukpani, Cross River State. Read More",
      "publishedAt": "2025-10-06T10:31:54+01:00",
      "officialUrl": "https://kadunaelectric.com/house-committee-tasks-ndphc-on-improvement-of-safety-standards-workers-welfare-at-calabar-power-plant/"
    },
    {
      "id": "76ed2827b5ec6d433d3a3a2b57bcadd5dd484ec5",
      "domain": "POWER",
      "tier": "OFFICIAL",
      "source": "Kaduna Electric",
      "title": "Electricity Act: Poor Nigerians, others to get tariff relief",
      "summary": "The new Chairman of the Nigerian Electricity Regulatory Commission, Abdullahi Ramat, has revealed that schools, hospitals and low-income Nigerians will benefit from a tariff relief package under the Electricity Act 2023. Read More",
      "publishedAt": "2025-10-06T10:29:02+01:00",
      "officialUrl": "https://kadunaelectric.com/electricity-act-poor-nigerians-others-to-get-tariff-relief/"
    }
  ],
  "latestOfficialByDomain": {
    "POWER": "2025-10-09T13:39:14+01:00"
  }
}